Тест_ЗУП_31_КОРП/src/Catalogs/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вакансии</name>
  <basedOn>Document.ЗаявкаНаПодборПерсонала</basedOn>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодборПерсонала</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРаботыСКандидатами</name>
    <attributes>
      <name>ЭтапРаботы</name>
      <type>
        <types>CatalogRef.ЭтапыРаботыСКандидатами</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонАнкеты</name>
      <type>
        <types>CatalogRef.ШаблоныАнкет</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/СостоянияВакансии/СостоянияВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВакансии</name>
  <enumValues>
    <name>Открыта</name>
  </enumValues>
  <enumValues>
    <name>Приостановлена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/СпособНабораПерсоналаНаВакансию/СпособНабораПерсоналаНаВакансию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособНабораПерсоналаНаВакансию</name>
  <enumValues>
    <name>МассовыйНабор</name>
  </enumValues>
  <enumValues>
    <name>ЕдиничныйНабор</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ЗаявкаНаПодборПерсонала/ЗаявкаНаПодборПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПодборПерсонала</name>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассмотрел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Catalogs/Кандидаты/Кандидаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кандидаты</name>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </attributes>
  <attributes>
    <name>Резюме</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РезюмеТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтапРаботы</name>
    <type>
      <types>CatalogRef.ЭтапыРаботыСКандидатами</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>СреднийРейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРезюме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Оценки</name>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/Вакансии/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КомандыФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодборПерсонала.ОбновитьСоставКомандОтправкиВакансий(ЭтотОбъект);
	
	НастроитьВидСпискаВакансий();
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Вакансии.РежимВыбора = Истина;
		Если Параметры.Свойство("СписокПодобранных") Тогда
			СписокПодобранных.ЗагрузитьЗначения(Параметры.СписокПодобранных);
			ОбновитьОтображениеПодобранных();
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ Параметры.РежимВыбора ИЛИ Параметры.Свойство("ТолькоОткрытыеВакансии") Тогда
		ЗначениеОтбора = Новый Массив;
		ЗначениеОтбора.Добавить(Перечисления.СостоянияВакансии.Приостановлена);
		ЗначениеОтбора.Добавить(Перечисления.СостоянияВакансии.Закрыта);
		ЗначениеОтбора.Добавить(Перечисления.СостоянияВакансии.Отменена);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Вакансии,
			"Состояние",
			ЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.НеВСписке,
			НСтр("ru = 'Только открытые вакансии'"),
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,
			Новый УникальныйИдентификатор);
	КонецЕсли;
	
	ШаблонСообщения = ПодборПерсонала.ШаблонСоСпискомСсылок("Справочник.Вакансии");
	
	УстановитьВидимостьОткликовКандидатов();
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Вакансии", , , , "Организация");
	
	СоздатьКомандыЗагрузкиССайта();
	
	СоздаватьВакансииТолькоПоЗаявке = ПолучитьФункциональнуюОпцию("ОткрытиеВакансииТребуетСогласования");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьПоЗаявке", "Видимость", СоздаватьВакансииТолькоПоЗаявке);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Создать", "Видимость", Не СоздаватьВакансииТолькоПоЗаявке);
	
	НастроитьСписокКандидатов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыНастройкиДоступаКСайтам" Тогда
		ОбработкаОповещенияИзмененыНастройкиДоступаКСайтам();
	ИначеЕсли ИмяСобытия = "ЗагруженыВакансии" Тогда
		Элементы.Вакансии.Обновить();
	КонецЕсли;
	
	ОбработатьОповещенияЭтаповРаботыСКандидатами(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ВладелецФормы <> ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыНовой = Новый Структура("Основание");
	ПараметрыНовой.Основание = ВыбранноеЗначение;
	
	ОткрытьФорму("Справочник.Вакансии.ФормаОбъекта", ПараметрыНовой, ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ОбработкаНавигационнойСсылкиПозицияМассовогоНабора(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработкаНавигационнойСсылкиСостоянияКандидатов(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоЗаявке(Команда)
	
	ПараметрыВыбора = Новый Структура("РежимВыбора, ТолькоДляСозданияВакансий");
	ПараметрыВыбора.РежимВыбора = Истина;
	ПараметрыВыбора.ТолькоДляСозданияВакансий = Истина;
	
	ОткрытьФорму("Документ.ЗаявкаНаПодборПерсонала.ФормаВыбора", ПараметрыВыбора, ЭтаФорма, ЭтаФорма, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Элементы.Вакансии.РежимВыбора И НЕ ЗакрыватьПриВыборе Тогда
		
		СтандартнаяОбработка = Ложь;
		
		МассивВыбранных = Элементы.Вакансии.ВыделенныеСтроки;
	
		КоличествоВыбранных = МассивВыбранных.Количество();
		Если КоличествоВыбранных Тогда
			ОповеститьОВыборе(МассивВыбранных);
		КонецЕсли;
		
		Если КоличествоВыбранных > 1 Тогда
			Закрыть();
		Иначе
			Для Каждого ВыбранноеЗначение Из МассивВыбранных Цикл
				Если СписокПодобранных.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
					СписокПодобранных.Добавить(ВыбранноеЗначение);
				КонецЕсли; 
			КонецЦикла;
			ОбновитьОтображениеПодобранных();			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаЗагрузитьССайта(Команда)
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ИнтеграцияРекрутинговыхСайтов") Тогда
		Возврат;
	КонецЕсли;

	МодульИнтеграцияРекрутинговыхСайтовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияРекрутинговыхСайтовКлиент");
	МодульИнтеграцияРекрутинговыхСайтовКлиент.ЗагрузитьВакансииССайта(Команда.Имя, СоответствиеКомандИСайтов, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВакансию(Команда)
	
	ВакансииМассив = ПодборПерсоналаКлиент.СсылкиНаОбъектыВыделенныхСтрокСписка(Элементы.Вакансии);
	
	Если ВакансииМассив.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = ПодборПерсоналаКлиент.ПараметрыФормированияПисьма(УникальныйИдентификатор);
	ДополнительныеПараметры.ИдентификаторПечатнойФормы = ПодборПерсоналаКлиент.ИдентификаторПечатнойФормы(Команда.Имя);
	ДополнительныеПараметры.Предметы = ВакансииМассив;
	
	Если ПолучитьФункциональнуюОпциюФормы("ИспользоватьШаблоныСообщений") Тогда
		ОткрытьФормуВыбораШаблона(ВакансииМассив[0], ДополнительныеПараметры);
	Иначе
		ДополнительныеПараметры.Вставить("ВывестиСписокПредметов");
		ПодборПерсоналаКлиент.СформироватьСообщениеБезШаблона(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВидимостьКомандОтправкиВакансий()
	ПодборПерсоналаКлиент.ОбновитьВидимостьКомандОтправкиВакансий(ЭтотОбъект, Элементы.Вакансии);
КонецПроцедуры

&НаКлиенте
Процедура ПоделитьсяСсылкой(Команда)
	
	ВакансииМассив = ПодборПерсоналаКлиент.СсылкиНаОбъектыВыделенныхСтрокСписка(Элементы.Вакансии);
	
	Если ВакансииМассив.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = ПодборПерсоналаКлиент.ПараметрыФормированияПисьма(УникальныйИдентификатор);
	ДополнительныеПараметры.Предметы = ВакансииМассив;
	
	Если ПолучитьФункциональнуюОпциюФормы("ИспользоватьШаблоныСообщений") Тогда
		Если ЗначениеЗаполнено(ШаблонСообщения) Тогда
			ПодборПерсоналаКлиент.Подключаемый_СформироватьСообщение(ШаблонСообщения, ДополнительныеПараметры);
		Иначе
			ОткрытьФормуВыбораШаблона(ВакансииМассив[0], ДополнительныеПараметры);
		КонецЕсли;
	Иначе
		ДополнительныеПараметры.Вставить("ВывестиСписокСсылок");
		ПодборПерсоналаКлиент.СформироватьСообщениеБезШаблона(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаВсеВакансии(Команда)
	
	ВидВсеВакансии = Истина;
	УстановитьВидСпискаВакансий(ЭтаФорма);
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоПодразделениям(Команда)
	
	ВидВсеВакансии = Ложь;
	УстановитьВидСпискаВакансий(ЭтаФорма);
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Вакансии);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Вакансии, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Вакансии);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПоказыватьОдобренныхОтклоненныхКандидатов(Команда)
	
	ПодборПерсоналаКлиентСервер.УстановитьСнятьОтборОдобренныхОтклоненныхКандидатов(
		Кандидаты, 
		Элементы.ПоказыватьОдобренныхОтклоненныхКандидатов.Пометка, 
		Элементы.ПоказыватьОдобренныхОтклоненныхКандидатов);
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодборПерсоналаКлиент.НачатьОбновлениеКомандОтправкиВакансий(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиВакансииНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПредприятияПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоПодразделениюНаКлиенте", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКомандыЗагрузкиССайта()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ИнтеграцияРекрутинговыхСайтов") Тогда
		МодульИнтеграцияРекрутинговыхСайтов = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияРекрутинговыхСайтов");
		МодульИнтеграцияРекрутинговыхСайтов.ВакансииСписокПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОткликовКандидатов()
	
	ОткликиКандидатов = ПодборПерсонала.ОткликиКандидатов(Вакансии.Отбор.Элементы);
	
	Если ОткликиКандидатов.Количество() = 0 Или Параметры.РежимВыбора Тогда
		Элементы.ОповещенияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ОповещенияГруппа.Видимость = Истина;
	ВакансииМассив = ОбщегоНазначения.ВыгрузитьКолонку(ОткликиКандидатов, "Вакансия", Истина);
	
	Если ВакансииМассив.Количество() = 1 Тогда
		ТекстПоВакансиям = НСтр("ru = 'по вакансии'");
	Иначе
		ТекстПоВакансиям = НСтр("ru = 'по вакансиям'");
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Есть не рассмотренные отклики (%1) %2'"), ОткликиКандидатов.Количество(), ТекстПоВакансиям);
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(ТекстСообщения);
	ЧастиСообщения.Добавить(" ");
	
	Индекс = 0;
	Пока Индекс < ВакансииМассив.Количество() Цикл
		Если Индекс > 3 Тогда
			// Слишком много — дальше не выводим.
			ЧастьЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = ' и по другим (всего %1)'"), ВакансииМассив.Количество());
			ЧастиСообщения.Добавить(ЧастьЗавершения);
			Прервать;
		КонецЕсли;
		Если Индекс > 0 Тогда
			ЧастиСообщения.Добавить(", ");
		КонецЕсли;
		Вакансия = ВакансииМассив[Индекс];
		ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(Строка(Вакансия), , , , ПолучитьНавигационнуюСсылку(Вакансия)));
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Элементы.ОповещениеОбОткликах.Заголовок = Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененыНастройкиДоступаКСайтам()
	
	КоличествоЭлементов = Элементы.КоманднаяПанельФормы.ПодчиненныеЭлементы.ФормаЗагрузить.ПодчиненныеЭлементы.Количество();
	ЭлементыДляУдаления = Новый Массив;
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		ЭлементыДляУдаления.Добавить(Элементы.КоманднаяПанельФормы.ПодчиненныеЭлементы.ФормаЗагрузить.ПодчиненныеЭлементы.Получить(Индекс));			
	КонецЦикла;
	
	Для Каждого ЭлементДляУдаления Из ЭлементыДляУдаления Цикл
		Элементы.Удалить(ЭлементДляУдаления);
	КонецЦикла;
	
	СоответствиеКомандИСайтов = Новый ФиксированноеСоответствие(Новый Соответствие);
	
	СоздатьКомандыЗагрузкиССайта();

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПодобранных()
	
	ЭлементУсловногоОформления = Неопределено;
	Для каждого ЭлементОформления Из УсловноеОформление.Элементы Цикл
		Если ЭлементОформления.Представление = НСтр("ru='Выделение подобранных'") Тогда
			ЭлементОформления.Отбор.Элементы[0].ПравоеЗначение = СписокПодобранных;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораШаблона(Вакансия, ПередаваемыеПараметры)
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_СформироватьСообщение", ОбщегоНазначенияКлиент.ОбщийМодуль("ПодборПерсоналаКлиент"), ПередаваемыеПараметры);
	
	ШаблоныСообщенийКлиент.ВыбратьШаблон(Оповещение, , Вакансия);
	
КонецПроцедуры

#Область ГруппировкаПоПодразделениям

&НаСервере
Процедура НастроитьВидСпискаВакансий()
	
	НастройкаВидВсеВакансии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ВакансииСписок", "ВидВсеВакансии");
	ВидВсеВакансии = НастройкаВидВсеВакансии;
	
	Если НастройкаВидВсеВакансии = Неопределено Тогда
		ВидВсеВакансии = Истина;
	КонецЕсли;
	
	УстановитьВидСпискаВакансий(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидСпискаВакансий(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СтруктураПредприятия", "Видимость", Не Форма.ВидВсеВакансии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Подразделение", "Видимость", Форма.ВидВсеВакансии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидСпискаВсеВакансии", "Пометка", Форма.ВидВсеВакансии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидСпискаПоПодразделениям", "Пометка", Не Форма.ВидВсеВакансии);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПодразделению(Форма)
	
	Если Форма.Элементы.СтруктураПредприятия.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ВидВсеВакансии Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.Вакансии, "Подразделение");
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Форма.Вакансии.Отбор, "Подразделение", Форма.Элементы.СтруктураПредприятия.ТекущаяСтрока, ВидСравненияКомпоновкиДанных.ВИерархии);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПодразделениюНаКлиенте()
	
	УстановитьОтборПоПодразделениюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПодразделениюНаСервере()
	
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСохраняемойНастройки()
	
	Настройки = СохраняемыеНастройки();
	Настройки.ВидВсеВакансии = ВидВсеВакансии;
	Настройки.ПоказыватьОдобренныхОтклоненныхКандидатов = Элементы.ПоказыватьОдобренныхОтклоненныхКандидатов.Пометка;
	СохранитьНастройкиНаСервере(Настройки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СохраняемыеНастройки()
	
	Настройки = Новый Структура(
		"ВидВсеВакансии,
		|ПоказыватьОдобренныхОтклоненныхКандидатов");
	Возврат Настройки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Настройки)
	
	Для Каждого КлючИЗначение Из Настройки Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ВакансииСписок", КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриАктивизацииСтрокиВакансииНаКлиенте()
	
	Если Элементы.Вакансии.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Вакансия = Элементы.Вакансии.ТекущаяСтрока;
	
	Если Вакансия = ВыбраннаяВакансия Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборКандидатовПоВакансии(ЭтаФорма, Вакансия);
	УстановитьЗаголовокГруппыКандидатовПоВакансии(ЭтаФорма, Вакансия);
	ЗаполнитьИнформационныеСтрокиВакансии(Вакансия);
	
	ВыбраннаяВакансия = Вакансия;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборКандидатовПоВакансии(Форма, Вакансия)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Форма.Кандидаты.Отбор, "Вакансия", Вакансия, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокГруппыКандидатовПоВакансии(Форма, Вакансия)
	
	ШаблонЗаголовка = НСтр("ru = 'Кандидаты на вакансию %1'");
	Форма.Элементы.КандидатыСписокГруппа.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, Вакансия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформационныеСтрокиВакансии(Вакансия)
	
	ИнформационныеСтроки = ИнформационныеСтрокиВакансии(Вакансия);

	Элементы.ИнформацияЗанятости.Заголовок = ИнформационныеСтроки.ИнформационнаяСтрокаЗанятости;
	Элементы.ИнформацияКандидатов.Заголовок = ИнформационныеСтроки.ИнформационнаяСтрокаКандидатов;
	
	ПозицииМассовогоНабора = ИнформационныеСтроки.ПозицииМассовогоНабора;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформационныеСтрокиВакансии(Вакансия)
	
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(Вакансия);
	
	ИнформационныеСтроки = Новый Структура(
		"ИнформационнаяСтрокаЗанятости,
		|ИнформационнаяСтрокаКандидатов,
		|ПозицииМассовогоНабора");
	
	Если ДанныеВакансии.СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.ЕдиничныйНабор Тогда
		ИнформационныеСтроки.ИнформационнаяСтрокаЗанятости = НСтр("ru = 'По вакансии ведется единичный набор.'");
	Иначе
		Справочники.Вакансии.ЗаполнитьИнформационнуюСтрокуЗанятости(
			ИнформационныеСтроки.ИнформационнаяСтрокаЗанятости, ДанныеВакансии.НазначениеНабора, ДанныеВакансии.Должность, ДанныеВакансии.Позиция, ДанныеВакансии.Подразделение, ИнформационныеСтроки.ПозицииМассовогоНабора);
	КонецЕсли;
	
	Справочники.Вакансии.ЗаполнитьИнформационнуюСтрокуКандидатов(
		ИнформационныеСтроки.ИнформационнаяСтрокаКандидатов, Вакансия, ДанныеВакансии.СпособНабора, ДанныеВакансии.Позиция, ДанныеВакансии.ДатаОткрытия, ИнформационныеСтроки.ПозицииМассовогоНабора);
		
	Возврат ИнформационныеСтроки;
		
КонецФункции

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиПозицияМассовогоНабора(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> "ПозицииМассовогоНабора" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ПозицииМассовогоНабора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор");
	ПараметрыФормы.Отбор = Новый Структура("Ссылка");
	ПараметрыФормы.Отбор.Ссылка = Новый Массив(ПозицииМассовогоНабора);
	ОткрытьФорму("Справочник.ШтатноеРасписание.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиСостоянияКандидатов(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "СостояниеКандидата_") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Отбор");
	ПараметрыФормы.Отбор = Новый Структура("Вакансия");
	ПараметрыФормы.Отбор.Вакансия = ВыбраннаяВакансия;
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "СостояниеКандидата_Этап_") <> 0 Тогда
		ПараметрыФормы.Отбор.Вставить("ЭтапРаботы", СостояниеКандидатаЭтапСсылкаПоНавигационнойСтроке(НавигационнаяСсылкаФорматированнойСтроки));
	КонецЕсли;
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "СостояниеКандидата_Решение_") <> 0 Тогда
		ПараметрыФормы.Отбор.Вставить("Состояние", СостояниеКандидатаРешениеПоНавигационнойСтроке(НавигационнаяСсылкаФорматированнойСтроки));
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Кандидаты.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеКандидатаЭтапСсылкаПоНавигационнойСтроке(НавигационнаяСсылкаФорматированнойСтроки)
	
	ИдентификаторЭтапа = Новый УникальныйИдентификатор(СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "СостояниеКандидата_Этап_", ""));
	ЭтапРаботы = Справочники.ЭтапыРаботыСКандидатами.ПолучитьСсылку(ИдентификаторЭтапа);
	
	Возврат ЭтапРаботы;
	
КонецФункции

&НаСервереБезКонтекста
Функция СостояниеКандидатаРешениеПоНавигационнойСтроке(НавигационнаяСсылкаФорматированнойСтроки)
	Возврат Перечисления.СостоянияСогласования[СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "СостояниеКандидата_Решение_", "")];
КонецФункции

&НаКлиенте
Процедура ОбработатьОповещенияЭтаповРаботыСКандидатами(ИмяСобытия, Параметр, Источник)
	
	ОбрабатываемыеСобытия = Новый Массив;
	ОбрабатываемыеСобытия.Добавить("ЗапланированЭтапРаботыСКандидатом");
	ОбрабатываемыеСобытия.Добавить("ЗавершенЭтапРаботыСКандидатом");
	ОбрабатываемыеСобытия.Добавить("УтвержденыКандидаты");
	ОбрабатываемыеСобытия.Добавить("ОтклоненыКандидаты");
	ОбрабатываемыеСобытия.Добавить("ОтменаРешенияПоКандидату");
	
	Если ОбрабатываемыеСобытия.Найти(ИмяСобытия) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметр.Свойство("Кандидаты") Или Не Параметр.Свойство("Вакансии") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметр.Вакансии.Найти(ВыбраннаяВакансия) <> Неопределено Тогда
		ЗаполнитьИнформационныеСтрокиВакансии(ВыбраннаяВакансия);
		Элементы.Кандидаты.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокКандидатов()
	
	Справочники.Кандидаты.УстановитьУсловноеОформлениеСпискаКандидатов(Кандидаты);
	
	ПоказыватьОдобренныхОтклоненныхКандидатов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ВакансииСписок", "ПоказыватьОдобренныхОтклоненныхКандидатов");
	Если ПоказыватьОдобренныхОтклоненныхКандидатов = Неопределено Тогда
		ПоказыватьОдобренныхОтклоненныхКандидатов = Ложь;
	КонецЕсли;
	ПодборПерсоналаКлиентСервер.УстановитьСнятьОтборОдобренныхОтклоненныхКандидатов(Кандидаты, Не ПоказыватьОдобренныхОтклоненныхКандидатов, Элементы.ПоказыватьОдобренныхОтклоненныхКандидатов);
	
КонецПроцедуры

#КонецОбласти
